Console.WriteLine("Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.");

Console.Write("введите число: ");
int chislo = Convert.ToInt32(Console.ReadLine());

