Console.WriteLine("Задайте двумерный массив. Напишите программу, которая поменяет местами первую и последнюю строку массива.");
