Console.WriteLine("Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.");

void zadacha() {
    Console.WriteLine("введите число: ");
    string chislo = Console.ReadLine();
    Console.WriteLine(chislo[2]);
}
zadacha();


