Console.WriteLine("Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.");
