print('Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.')
