print('Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.')
