from tokenize import Double


print('Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа. \n*Примеры:* \n- 6,78 -> 7')

n = abs(tuple(input('введите число: ')))
print(n)
