print('Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.')

day = input('введите день недели: ')
if day == '1':
    print('нет')
elif day == '2':
    print('нет')
elif day == '3':
    print('нет')
elif day == '4':
    print('нет')
elif day == '5':
    print('нет')
elif day == '6':
    print('да')
elif day == '7':
    print('да')
else: print('пробуй еще')